{
  "category": "crafting_systems",
  "title": "Furnace",
  "iconType": "BLOCK",
  "icon": "minecraft:furnace",
  "pages": [
    {
      "sections": [
        { 
          "type": "text", 
          "title": "The Heart of Smelting",
          "text": "The [[entry:furnace:Furnace]] is Minecraft's primary smelting station, essential for transforming raw materials into usable resources. This versatile block can smelt ores, cook food, and process various materials that can't be crafted directly.\n\nSmelting is a fundamental process in Minecraft that unlocks the true potential of many materials. Raw ores like [[entry:furnace:iron ore]] and [[entry:furnace:copper ore]] must be smelted to become ingots, while raw meat needs to be cooked to provide better nutrition and avoid food poisoning.\n\nThe furnace operates on a simple principle: place fuel in the bottom slot and the item to be smelted in the top slot. The furnace will consume fuel over time, gradually converting the input item into its smelted form. This process is essential for creating [[entry:furnace:metal tools]], [[entry:furnace:glass]], [[entry:furnace:ceramics]], and many other advanced materials."
        },
        { 
          "type": "showcase", 
          "items": ["minecraft:furnace"] 
        }
      ]
    },
    {
      "sections": [
        { 
          "type": "recipe", 
          "title": "Furnace Recipe",
          "recipeType": "crafting", 
          "recipeId": "minecraft:furnace" 
        },
        { 
          "type": "text", 
          "title": "Furnace Operation",
          "text": "To use a furnace, right-click on it to open the smelting interface. The top slot accepts items to be smelted, while the bottom slot requires fuel. Common fuels include [[entry:furnace:coal]], [[entry:furnace:charcoal]], [[entry:furnace:wood]], and [[entry:furnace:blaze rods]].\n\nThe smelting process takes time - each item requires several seconds to complete, and the furnace will continue working as long as there's fuel available. The progress bar shows how close the current item is to being finished.\n\nFurnaces are essential for processing [[entry:furnace:raw ores]] into ingots, cooking [[entry:furnace:raw meat]] into cooked food, and creating [[entry:furnace:glass]] from sand. They're also used to make [[entry:furnace:charcoal]] from wood, which is a renewable fuel source."
        }
      ]
    },
    {
      "sections": [
        { 
          "type": "recipe", 
          "title": "Example: Iron Ingot Smelting",
          "recipeType": "smelting", 
          "recipeId": "minecraft:iron_ingot_from_smelting_raw_iron" 
        },
        { 
          "type": "text", 
          "title": "Advanced Smelting Techniques",
          "text": "While the basic furnace is essential, there are specialized variants that offer improved efficiency. The [[entry:smoker:Smoker]] cooks food items twice as fast as a regular furnace, while the [[entry:blast_furnace:Blast Furnace]] smelts ores and metal items at double speed.\n\nFuel efficiency is crucial for sustainable smelting. [[entry:furnace:Coal]] provides 8 smelting operations, while [[entry:furnace:charcoal]] offers the same efficiency and is renewable. [[entry:furnace:Blaze rods]] are excellent for long smelting sessions, providing 12 operations each.\n\nThe furnace is also essential for creating [[entry:furnace:advanced materials]] like [[entry:furnace:terracotta]], [[entry:furnace:stone]], and [[entry:furnace:nether brick]]. Many players set up automated smelting systems using [[entry:furnace:hoppers]] to feed items and fuel continuously, creating efficient production lines for large-scale crafting projects."
        }
      ]
    }
  ]
}


