{
  "category": "crafting_systems",
  "title": "Smithing Table",
  "iconType": "BLOCK",
  "icon": "minecraft:smithing_table",
  "pages": [
    {
      "sections": [
        { 
          "type": "text", 
          "title": "Advanced Tool Enhancement",
          "text": "The [[entry:smithing_table:Smithing Table]] is a specialized crafting station designed for upgrading and modifying tools, weapons, and armor. This advanced workstation allows players to apply [[entry:smithing_table:upgrade templates]], combine materials, and transform basic equipment into powerful, specialized gear.\n\nUnlike the [[entry:crafting_table:crafting table]] which creates items from scratch, the smithing table focuses on improving existing equipment. It's essential for players who want to create the most powerful tools and weapons possible, as it's the only way to craft [[entry:smithing_table:netherite equipment]] and apply various upgrade templates.\n\nThe smithing table operates on a unique principle - it requires a base item (like a diamond tool), an upgrade template (which determines the type of enhancement), and additional materials (like netherite ingots for netherite upgrades). This system allows for highly customizable equipment that can be tailored to specific needs and playstyles."
        },
        { 
          "type": "showcase", 
          "items": ["minecraft:smithing_table"] 
        }
      ]
    },
    {
      "sections": [
        { 
          "type": "recipe", 
          "title": "Smithing Table Recipe",
          "recipeType": "crafting", 
          "recipeId": "minecraft:smithing_table" 
        },
        { 
          "type": "text", 
          "title": "Smithing Table Operation",
          "text": "To use a smithing table, right-click on it to open the enhancement interface. The left slot accepts the base item to be upgraded (typically diamond tools, weapons, or armor), the center slot requires an upgrade template (which determines the type of enhancement), and the right slot needs additional materials.\n\nCommon upgrade templates include the [[entry:smithing_table:netherite upgrade template]] for converting diamond equipment to netherite, the [[entry:smithing_table:armor trim templates]] for adding decorative patterns to armor, and various other specialized enhancement templates. Each template requires specific materials and provides unique benefits.\n\nThe smithing table is the only way to create [[entry:smithing_table:netherite equipment]], which represents the pinnacle of Minecraft gear. Netherite tools and weapons offer superior durability, damage, and mining speed compared to diamond equipment, making them essential for end-game content and challenging environments."
        }
      ]
    },
    {
      "sections": [
        { 
          "type": "recipe", 
          "title": "Example: Netherite Sword Upgrade",
          "recipeType": "smithing", 
          "items": ["minecraft:netherite_upgrade_smithing_template", "minecraft:diamond_sword", "minecraft:netherite_ingot", "minecraft:netherite_sword"] 
        },
        { 
          "type": "text", 
          "title": "Advanced Equipment Enhancement",
          "text": "The smithing table represents the most advanced form of equipment crafting in Minecraft. While the [[entry:crafting_table:crafting table]] creates basic items and the [[entry:furnace:furnace]] processes raw materials, the smithing table transforms existing equipment into superior versions.\n\nUpgrade templates are rare and valuable items that can be found in various structures throughout the world. The [[entry:smithing_table:netherite upgrade template]] is particularly valuable as it allows players to convert diamond equipment to netherite, providing significant improvements in durability and performance.\n\nThe smithing table system encourages players to invest in high-quality base equipment, as the upgrade process preserves enchantments and other properties while significantly improving the item's base stats. This makes it an essential part of any player's progression toward end-game content.\n\nConsider building your smithing table in a dedicated workshop area, as you'll likely spend significant time here upgrading and customizing your equipment. The smithing table is a testament to Minecraft's depth and complexity, offering players the ability to create truly personalized and powerful gear."
        }
      ]
    }
  ]
}
