{
  "category": "crafting_systems",
  "title": "Stonecutter",
  "iconType": "BLOCK",
  "icon": "minecraft:stonecutter",
  "pages": [
    {
      "sections": [
        { 
          "type": "text", 
          "title": "Precision Stone Processing",
          "text": "The [[entry:stonecutter:Stonecutter]] is a specialized crafting station designed for processing stone and related materials into various decorative and functional blocks. This precision tool allows players to create [[entry:stonecutter:stone variants]], [[entry:stonecutter:stairs]], [[entry:stonecutter:slabs]], and [[entry:stonecutter:walls]] from basic stone materials without the complex crafting patterns required by the [[entry:crafting_table:crafting table]].\n\nUnlike other crafting stations that focus on creating items from scratch or processing raw materials, the stonecutter specializes in transforming existing stone blocks into more refined forms. It's essential for players who want to create detailed architectural designs, as it provides access to building blocks that would be difficult or impossible to craft through traditional methods.\n\nThe stonecutter operates on a simple principle - place a stone block in the input slot and select the desired output from the available options. This streamlined process makes it much easier to create large quantities of specific stone variants for building projects."
        },
        { 
          "type": "showcase", 
          "items": ["minecraft:stonecutter"] 
        }
      ]
    },
    {
      "sections": [
        { 
          "type": "recipe", 
          "title": "Stonecutter Recipe",
          "recipeType": "crafting", 
          "recipeId": "minecraft:stonecutter" 
        },
        { 
          "type": "text", 
          "title": "Stonecutter Operation",
          "text": "To use a stonecutter, right-click on it to open the processing interface. Place a stone block in the input slot, and the interface will display all available output options for that material. Simply click on the desired output to create it instantly.\n\nMaterials that can be processed in a stonecutter include [[entry:stonecutter:stone]], [[entry:stonecutter:cobblestone]], [[entry:stonecutter:sandstone]], [[entry:stonecutter:quartz]], [[entry:stonecutter:blackstone]], and various other stone variants. Each material offers different output options, from basic blocks to complex architectural elements.\n\nThe stonecutter is particularly valuable for creating [[entry:stonecutter:stairs]], [[entry:stonecutter:slabs]], and [[entry:stonecutter:walls]], which are essential for building detailed structures. These blocks would normally require complex crafting patterns, but the stonecutter creates them with a single click, making it much more efficient for large building projects."
        }
      ]
    },
    {
      "sections": [
        { 
          "type": "recipe", 
          "title": "Example: Stone Brick Processing",
          "recipeType": "stonecutting", 
          "recipeId": "minecraft:stone_bricks_from_stone_stonecutting" 
        },
        { 
          "type": "text", 
          "title": "Advanced Stone Working",
          "text": "The stonecutter represents a specialized form of material processing in Minecraft. While the [[entry:crafting_table:crafting table]] creates items from multiple ingredients and the [[entry:furnace:furnace]] transforms raw materials, the stonecutter refines existing blocks into more useful forms.\n\nThis specialized workstation is essential for players who engage in extensive building projects, as it provides access to a wide variety of architectural elements that would be difficult to craft through traditional methods. The stonecutter's efficiency makes it possible to create detailed, professional-looking structures without spending excessive time on complex crafting patterns.\n\nThe stonecutter system encourages players to think about materials in terms of their potential rather than just their basic form. A simple stone block can become stairs, slabs, walls, or other architectural elements, greatly expanding the creative possibilities for building projects.\n\nConsider building your stonecutter in a dedicated masonry workshop, complete with storage for various stone types and easy access to your building sites. The stonecutter is a testament to Minecraft's attention to detail and the importance of specialized tools for specific crafting tasks."
        }
      ]
    }
  ]
}
